# Дано k відсортованих списків цілих чисел.
# Ваше завдання — об'єднати їх у один відсортований список.
# Тепер при виконанні завдання ви повинні використати мінімальну купу
# для ефективного злиття кількох відсортованих списків в один відсортований список.
# Реалізуйте функцію merge_k_lists, яка приймає на вхід список відсортованих списків
# та повертає відсортований список.

import heapq


def merge_k_lists(lists):
    """Функція для злиття k відсортованих списків у один відсортований список."""
    min_heap = []

    # Ініціалізуємо мінімальну купу першими елементами кожного списку
    for i, lst in enumerate(lists):
        if lst:  # Перевіряємо, чи список не порожній
            heapq.heappush(min_heap, (lst[0], i, 0))  # (значення, індекс списку, індекс елемента)
            print(f"Додаємо до купи: {lst[0]} з списку {i}, купа: {min_heap}")

    merged_list = []

    while min_heap:
        value, list_idx, element_idx = heapq.heappop(min_heap)
        merged_list.append(value)
        print(f"Вийняли з купи: {value} з списку {list_idx}, купа зараз: {min_heap}, об'єднаний список: {merged_list}")

        # Якщо є наступний елемент у тому ж списку, додамо його до купи
        if element_idx + 1 < len(lists[list_idx]):
            next_value = lists[list_idx][element_idx + 1]
            heapq.heappush(min_heap, (next_value, list_idx, element_idx + 1))
            print(f"Додали до купи: {next_value} з списку {list_idx}, купа зараз: {min_heap}, об'єднаний список: {merged_list}")

    return merged_list


lists = [[1, 4, 5], [1, 3, 4], [2, 6]]
merged_list = merge_k_lists(lists)
print("Відсортований список:", merged_list)

# " Пояснення:
# Ми використовуємо мінімальну купу для ефективного злиття k відсортованих списків.
# Спочатку ми додаємо перші елементи кожного списку до купи.
# Потім ми повторно витягуємо найменший елемент з купи та додаємо його до результату.
# Якщо у списку, з якого був витягнутий елемент, є наступний елемент, ми додаємо його до купи.
# Цей процес повторюється, поки купа не стане порожньою.
# Якби ми просто об'єднали всі списки в купу, це було б менш ефективно з точки зору використання пам'яті, особливо при великій кількості списків або елементів.
# Використання мінімальної купи дозволяє нам зберігати лише поточні найменші елементи, що значно знижує використання пам'яті."
